# Python : Pandas
- pandas for panel data(big data)
- panel data : same subjects
- Flexibile indexing
- Series(1차원), DataFrames(2차원), MultiIndex(다차원)
- panel data는 시간에 따른 데이터 변화를 나타낸 것이다

세상에 존재하는 다양한 형태의 데이터를 모아서 처리하는데 유리하다(<=>수치연산의 넘파이)

__1. Pandas : Series creation and indexing__

In [1]:
import pandas as pd

In [3]:
grades = pd.Series(range(80, 100, 2))
print(grades)
#리스트에서는 range, 넘파이에서는 arange, 판다스에서는 range
#인덱스는 자동으로 만들어진다

0    80
1    82
2    84
3    86
4    88
5    90
6    92
7    94
8    96
9    98
dtype: int64

In [4]:
print(grades.describe())
#판다스는 인덱스를 유연하게 변경할 수 있다 + 원하는 내용을 인덱스로 사용할 수 있다
print(len(grades))

count    10.000000
mean     89.000000
std       6.055301
min      80.000000
25%      84.500000
50%      89.000000
75%      93.500000
max      98.000000
dtype: float64
10

In [7]:
height = pd.Series([175,184,170], index = ['Kim','Kwon','Lee']) #인덱스지정
print(height)
print(height.Kwon, height['Kwon'], height[1]) #다양하게 출력 가능

Kim     175
Kwon    184
Lee     170
dtype: int64
184 184 184

In [8]:
nations = pd.Series({'Korea':82,'Japan':81,'China':'cn'}) 
#리스트와 인덱스로 구성하는 방법 외에 dictionary를 이용할 수 있다
print(nations)
#판다스에서 인덱스는 왼쪽정렬, 컬럼의 변수는 오른쪽 정렬을 한다

Korea    82
Japan    81
China    cn
dtype: object

__2. Pnadas : DataFrames creation and indexing__

In [9]:
season_temps = pd.DataFrame({'Spring':[10,14,18],'Summer':[24,27,30],'\
Fall':[24,21,18],'Winter':[8,0,-5]})
print(season_temps)
#2차원 배열의 경우 키값이 자동으로 columns이 된다
#row인덱스는 별도로 지정해줄 수 있다

   Spring  Summer  Fall  Winter
0      10      24    24       8
1      14      27    21       0
2      18      30    18      -5

In [10]:
scores = {'Kim':[87,96,70],'Park':[100,87,90],'Sam':[94,77,90],'Kwon':[100,90,95],'Lee':[83,65,85]}
scores_df = pd.DataFrame(scores)
print(scores_df)

   Kim  Park  Sam  Kwon  Lee
0   87   100   94   100   83
1   96    87   77    90   65
2   70    90   90    95   85

In [12]:
scores_ni = pd.DataFrame(scores, index = ['Math','Econ','Physics']) #새로운 변수로
print(scores_ni)
scores_df.index = ['Math','Econ','Physics'] #기존의 df에 인덱스 추가, 변형
print(scores_df)

         Kim  Park  Sam  Kwon  Lee
Math      87   100   94   100   83
Econ      96    87   77    90   65
Physics   70    90   90    95   85
         Kim  Park  Sam  Kwon  Lee
Math      87   100   94   100   83
Econ      96    87   77    90   65
Physics   70    90   90    95   85

__3. Pandas : DataFrame slicing__
- loc : 설정해준 row네임으로
- iloc : 자동할당된 index넘버로
- at : 2차원의 DF에서 특정 데이터만 뽑아내는 것
- iat : index를 특정하여 데이터를 뽑아내는 것

In [14]:
print(f'{season_temps.loc[0]}\n\n{season_temps.iloc[0]}')

Spring    10
Summer    24
Fall      24
Winter     8
Name: 0, dtype: int64

Spring    10
Summer    24
Fall      24
Winter     8
Name: 0, dtype: int64

In [23]:
print(f'{scores_ni.loc["Math":"Econ"]}\n\n{scores_df.iloc[:2,:3]}')

      Kim  Park  Sam  Kwon  Lee
Math   87   100   94   100   83
Econ   96    87   77    90   65

      Kim  Park  Sam
Math   87   100   94
Econ   96    87   77

In [27]:
print(f'{scores_df.loc[["Math","Physics"]]}\n\n{scores_df.iloc[[0,2],:3]}')
#콤마를 사용하면 특정 데이터값만 뽑아내는 것, 콜론은 일정 구간을 뽑아내는 기능

         Kim  Park  Sam  Kwon  Lee
Math      87   100   94   100   83
Physics   70    90   90    95   85

         Kim  Park  Sam
Math      87   100   94
Physics   70    90   90

In [29]:
print(f'{scores_ni.loc["Math":"Physics",["Kim","Sam"]]}\
\n\n{scores_df.iloc[[0,2],0:3]}')

         Kim  Sam
Math      87   94
Econ      96   77
Physics   70   90

         Kim  Park  Sam
Math      87   100   94
Physics   70    90   90

In [32]:
print(f'{scores_ni.loc[["Math","Physics"],["Kim","Sam"]]}')

         Kim  Sam
Math      87   94
Physics   70   90

In [36]:
print(scores_df)
print(scores_df.at['Econ','Kwon'], scores_df.iat[1,3])

         Kim  Park  Sam  Kwon  Lee
Math      87   100   94   100   83
Econ      96    87   77    90   65
Physics   70    90   90    95   85
90 90

__4. Pandas : Boolean indexing__

In [38]:
scores_df[scores_df >= 90]
#판다스에서 결측 데이터는 'NAN(Not A Number)'으로 표시됨

          Kim   Park   Sam  Kwon  Lee
Math      NaN  100.0  94.0   100  NaN
Econ     96.0    NaN   NaN    90  NaN
Physics   NaN   90.0  90.0    95  NaN

In [41]:
scores_df[(scores_df < 90) & (scores_df > 70)]

          Kim  Park   Sam  Kwon   Lee
Math     87.0   NaN   NaN   NaN  83.0
Econ      NaN  87.0  77.0   NaN   NaN
Physics   NaN   NaN   NaN   NaN  85.0

__5. Pandas : Descriptive statistics__

In [42]:
pd.set_option('precision', 3) #소수점 셋째자리까지 표현하라
print(scores_df.describe())

          Kim     Park     Sam   Kwon     Lee
count   3.000    3.000   3.000    3.0   3.000
mean   84.333   92.333  87.000   95.0  77.667
std    13.204    6.807   8.888    5.0  11.015
min    70.000   87.000  77.000   90.0  65.000
25%    78.500   88.500  83.500   92.5  74.000
50%    87.000   90.000  90.000   95.0  83.000
75%    91.500   95.000  92.000   97.5  84.000
max    96.000  100.000  94.000  100.0  85.000

In [49]:
scores_df.mean()
scores_df.std()

Kim     13.204
Park     6.807
Sam      8.888
Kwon     5.000
Lee     11.015
dtype: float64

__6. Pandas : Transposing__

In [50]:
scores_df.T #전치

      Math  Econ  Physics
Kim     87    96       70
Park   100    87       90
Sam     94    77       90
Kwon   100    90       95
Lee     83    65       85

In [51]:
scores_df.T.describe()

          Math    Econ  Physics
count    5.000   5.000    5.000
mean    92.800  83.000   86.000
std      7.662  12.186    9.618
min     83.000  65.000   70.000
25%     87.000  77.000   85.000
50%     94.000  87.000   90.000
75%    100.000  90.000   90.000
max    100.000  96.000   95.000

__7. Pandas : Sorting by index and values__

In [52]:
season_temps.sort_index(ascending=False) #== descending (descending = True는 지원x)
#판다스는 메서드 방식으로 일관성있게 활용할 수 있다

   Spring  Summer  Fall  Winter
2      18      30    18      -5
1      14      27    21       0
0      10      24    24       8

In [53]:
scores_df.sort_index()
#숫자가 아닐떄의 순서는 아스키코드순서(E-.M->P), column은 그대로

         Kim  Park  Sam  Kwon  Lee
Econ      96    87   77    90   65
Math      87   100   94   100   83
Physics   70    90   90    95   85

In [54]:
scores_df.sort_index(axis=1) #column을 기준으로 정렬, 알파벳 순서

         Kim  Kwon  Lee  Park  Sam
Math      87   100   83   100   94
Econ      96    90   65    87   77
Physics   70    95   85    90   90

In [61]:
scores_df.sort_values(by = 'Econ', axis=1, ascending = False)
#경제학 순서대로 정렬(내림차순)

         Kim  Kwon  Park  Sam  Lee
Math      87   100   100   94   83
Econ      96    90    87   77   65
Physics   70    95    90   90   85

In [63]:
scores_df.T.sort_values(by = 'Econ', ascending = False)
#트랜스포즈하여 경제학 순서대로 정렬

      Math  Econ  Physics
Kim     87    96       70
Kwon   100    90       95
Park   100    87       90
Sam     94    77       90
Lee     83    65       85

__8. Pandas : One hot vector__
- 여러가지 그룹데이터에서 그룹별로 더미(가변수)를 주는 것
- 머신러닝/딥러닝에서 많이 쓰는 아이리스데이터(세토사, 퍼스트컬러 등)에서 분류를 할 때, 이름으로 들어간 경우 처리가 될 때(가변수로 처리)/안될 떄가 있다. 그 때 임의로 그룹인덱스를 구분할 때, 순서/가치판단이 아닌 단순 구분을 위함
- 그리하여 여러 개의 칼럼을 갖는 벡터를 만들어 순서를 주지 않은 채로 0과 1로만 구성된 벡터를 만드는데, 그게 바로 원 핫 벡터이다
- 왜 원핫벡터? 뉴런이 빤짝!

In [79]:
auto_firms = ['Hundai','Honda','Kia','Audi','Benz','Hundai','Benz','Audi','Hundai',
              'Kia','Honda','Kia','Audi','Hundai','Benz']
Year = list(range(1990,2005,1)); Rank = list(range(15))
auto_df = pd.DataFrame({'Year':Year, 'Rank':Rank, 'Maker':auto_firms})
print(auto_df)

    Year  Rank   Maker
0   1990     0  Hundai
1   1991     1   Honda
2   1992     2     Kia
3   1993     3    Audi
4   1994     4    Benz
5   1995     5  Hundai
6   1996     6    Benz
7   1997     7    Audi
8   1998     8  Hundai
9   1999     9     Kia
10  2000    10   Honda
11  2001    11     Kia
12  2002    12    Audi
13  2003    13  Hundai
14  2004    14    Benz

In [80]:
am_onehot = pd.get_dummies(auto_df['Maker'])
#get_dummies == 가장 편하게 더미변수로 변화하는 방법!
print(am_onehot)

    Audi  Benz  Honda  Hundai  Kia
0      0     0      0       1    0
1      0     0      1       0    0
2      0     0      0       0    1
3      1     0      0       0    0
4      0     1      0       0    0
5      0     0      0       1    0
6      0     1      0       0    0
7      1     0      0       0    0
8      0     0      0       1    0
9      0     0      0       0    1
10     0     0      1       0    0
11     0     0      0       0    1
12     1     0      0       0    0
13     0     0      0       1    0
14     0     1      0       0    0

## 10주차 퀴즈

In [93]:
A = pd.Series({'Korea':82,'Japan':81,'China':'cn'})
A

Korea    82
Japan    81
China    cn
dtype: object

In [85]:
print(A['Korea'])

82

In [100]:
A.iloc[0]

82

In [91]:
B = pd.DataFrame(A, columns = ['nation'])

In [96]:
B.iloc[0]

nation    82
Name: Korea, dtype: object

In [101]:
stemps = pd.DataFrame({'Spring':[10,14,18],'Summer':[24,27,30],'\
Fall':[24,21,18],'Winter':[8,0,-5]})

In [110]:
stemps.index= ['a','b','c']
stemps

   Spring  Summer  Fall  Winter
a      10      24    24       8
b      14      27    21       0
c      18      30    18      -5

In [111]:
stemps.iat[1,3]

0

In [112]:
stemps.sort_index(ascending=False)

   Spring  Summer  Fall  Winter
c      18      30    18      -5
b      14      27    21       0
a      10      24    24       8

In [113]:
stemps.describe().T

        count  mean    std   min   25%   50%   75%   max
Spring    3.0  14.0  4.000  10.0  12.0  14.0  16.0  18.0
Summer    3.0  27.0  3.000  24.0  25.5  27.0  28.5  30.0
Fall      3.0  21.0  3.000  18.0  19.5  21.0  22.5  24.0
Winter    3.0   1.0  6.557  -5.0  -2.5   0.0   4.0   8.0

In [114]:
stemps.mean()

Spring    14.0
Summer    27.0
Fall      21.0
Winter     1.0
dtype: float64

In [118]:
stemps.sort_index()

   Spring  Summer  Fall  Winter
a      10      24    24       8
b      14      27    21       0
c      18      30    18      -5

1. indexing이 list처럼 숫자로만 이루어지지는 않는다!!!!!
2. Dictionary 형태로 Series를 만들 때 key는 열x 행 index가 된다
4. Series에서는 DataFrame에서와 달리 list에서 사용한 indexing방법을 사용할 수 있다